export const PRIVATE_TERMS = {
  title: `[당신의재재] (이하 "회사" 또는 "당신의재재")`,
  body: '제정일: [2025.11.4]',
  contents: [
    {
      title: '',
      description: [
        {
          title: '제1조 (개인정보의 처리 목적)',
          body: `당신의재재는 다음의 목적을 위하여 개인정보를 처리합니다.
  1. 회원 가입 및 관리: 카카오 계정을 통한 본인 식별 및 인증, 회원 자격 유지·관리, 고충처리 등을 목적으로 합니다.
  2. 서비스 제공 및 운영: 정비사업 관련 정보 콘텐츠 제공, 맞춤 서비스 제공, 서비스 접속 기록 및 이용 현황 분석 등을 목적으로 합니다.
  3. 고충처리: 민원인의 신원 확인, 민원사항 확인, 처리결과 통보 등의 목적으로 합니다.
  4. 마케팅 및 광고의 활용 (※선택 동의 시): 신규 서비스 개발 및 맞춤 서비스 제공 등을 목적으로 합니다.`,
        },
        {
          title: '제2조 (개인정보의 처리 및 보유 기간)',
          body: `회사는 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 동의받은 기간 내에서 개인정보를 처리 및 보유합니다.
  • 회원가입 및 본인 인증 (필수): 카카오 계정 식별 값, 닉네임, 프로필 사진 등을 카카오 API 연동을 통해 수집하며, 회원 탈퇴 시까지 보유합니다.
  • 서비스 제공 (선택): 이름, 휴대전화번호를 서비스 내 직접 입력을 통해 수집하며, 이는 서비스 철회 시 까지 보유합니다.
  • 서비스 이용 기록: IP 주소, 서비스 접속 일시, 이용 기록 등을 자동 수집하며, [최소 3개월, 최대 1년] 보존 후 파기합니다.`,
        },
        {
          title: '제3조 (개인정보의 제3자 제공)',
          body: `당신의재재는 정보주체의 개인정보를 제1조(개인정보의 처리 목적)에서 명시한 범위를 초과하여 처리하거나, 정보주체의 동의 없이 제3자에게 제공하지 않습니다. 다만, 이용자가 사전에 동의했거나, 법령의 특별한 규정이 있는 경우에 한하여 예외적으로 제공할 수 있습니다.`,
        },
        {
          title: '제3조의2 (가명정보 또는 익명정보의 제3자 제공 및 판매)',
          body: `1. 회사는 정보주체의 개인 식별 정보(이름, 연락처 등)를 제외한 사용자 이용 행태(접속 시간, 조회 콘텐츠, 북마크 사업장 정보 등)를 익명화 또는  가명화하여 제3자에게 제공하거나 판매할 수 있습니다.
2.제공 목적:
  • 통계 작성 및 산업 분석 자료 활용
  • 제3자(기업, 연구기관 등)와의 공동 연구 및 영리적 통계 데이터 판매
3.제공 항목: 접속 일시, 이용 기록, 접속 지역(구 단위), 조회 콘텐츠, 북마크 사업장 정보 등 개인 식별이 불가능한 행태 정보`,
        },
        {
          title: '제4조 (개인정보처리의 위탁)',
          body: `당신의재재는 원활한 개인정보 업무처리를 위하여 다음과 같이 개인정보 처리업무를 위탁하고 있습니다.
  • Amazon Web Services Inc. (AWS): 개인정보 및 서비스 데이터 보관을 위한 클라우드 서버 운영 및 관리
  • Google Analytics: 웹사이트 이용 내역 모니터링 및 분석`,
        },
        {
          title: '제5조 (개인정보의 국외이전)',
          body: `서비스 운영을 위해 개인정보를 다음과 같이 국외로 이전합니다.
  • Amazon Web Service Inc. (AWS) (이전 국가: 미국, 일본): 서비스 운영 및 데이터 저장
  • Google (이전 국가: 미국): 웹 분석 및 서비스 오류 정보 수집`,
        },
        {
          title: '제6조 (정보주체의 권리 행사 및 거부권)',
          body: `정보주체는 당신의재재에 대해 언제든지 다음의 권리를 행사할 수 있으며, 이는 서비스 내 '마이페이지' 의 '설정' 메뉴를 통해 진행할 수 있습니다.
1.개인정보 열람, 정정·삭제, 처리정지 요구
2.제3조의2에 따른 가명정보 또는 익명정보의 제공 및 판매에 대한 거부권
  • 정보주체는 제3조의2에 명시된 비식별 정보의 제3자 제공 및 판매에 대해 언제든지 거부할 수 있습니다.
  • 거부할 경우, 해당 정보주체의 비식별 정보는 통계 데이터로 활용되거나 제3자에게 제공되지 않습니다.
  • 단, 거부로 인해 서비스 이용에 대한 불이익은 발생하지 않습니다.`,
        },
        {
          title: '제7조 (개인정보 보호 책임자)',
          body: `개인정보 처리에 관한 업무를 총괄하고 불만 처리 및 피해 구제 등을 위하여 아래와 같이 개인정보 보호 책임자를 지정하고 있습니다.
  • 개인정보 보호 책임자 성명: [이필순]
  • 연락처: [01024659954], [jajattok@gmail.com]`,
        },
      ],
    },
  ],
};

export const POLICIES_TERMS = {
  title: `[당신의재재/당신의재건축재개발] (이하 "회사" 또는 "당신의재재"),`,
  body: '부칙 시행일: [2025.11.5]',
  contents: [
    {
      title: '제1장 총칙',
      description: [
        {
          title: '제1조 (목적)',
          body: `본 약관은 당신의재재 서비스(이하 "서비스")의 이용 조건 및 절차, 회사와 회원의 권리, 의무 및 책임사항을 규정함을 목적으로 합니다.`,
        },
        {
          title: '제2조 (용어의 정의)',
          body: `1. "서비스"라 함은 회사가 [jaejaeinfo.com]를 통해 구현하는 정비사업 관련 정보 콘텐츠 제공 및 관련 온라인 서비스를 의미합니다.
2. "회원"이라 함은 본 약관에 동의하고 회사가 제공하는 회원 가입 절차를 완료하여 서비스를 이용하는 자를 말합니다.
3. "카카오 계정"이라 함은 회원의 회원가입 및 본인 확인을 위해 이용되는 카카오톡 계정을 말합니다.
4. "게시물"이라 함은 회원이 서비스 상에 게시한 부호, 문자, 이미지, 파일 등의 정보 일체를 말합니다.`,
        },
        {
          title: '제3조 (약관의 효력 및 변경)',
          body: `1. 본 약관은 회원이 약관 내용에 동의하고 서비스 이용을 신청한 후 회사가 승낙함으로써 효력이 발생합니다.
2. 회사는 관계 법령을 위배하지 않는 범위 내에서 본 약관을 변경할 수 있으며, 변경된 약관은 그 적용일자 7일 전부터 공지합니다.`,
        },
      ],
    },
    {
      title: '제2장 서비스 이용 계약',
      description: [
        {
          title: '제4조 (회원가입 및 승낙)',
          body: `1. 회원가입은 가입신청자가 본 약관에 동의하고, 카카오 계정 인증을 통해 이용 신청을 하고, 회사가 이를 승낙함으로써 체결됩니다.
2. 회사는 타인의 명의를 도용하거나 허위 정보를 제공하는 등 문제가 있는 신청에 대해서는 승낙을 거절하거나 사후에 이용계약을 해지할 수 있습니다.`,
        },
        {
          title: '제5조 (개인정보보호 의무)',
          body: `1. 회사는 관계 법령이 정하는 바에 따라 회원의 개인정보를 보호하며, 개인정보의 보호 및 이용에 대해서는 관계 법령 및 회사의 개인정보처리방침이 적용됩니다.`,
        },
        {
          title: '제6조 (회원 정보 변경)',
          body: `회원은 서비스 내 카카오 계정 관리 기능을 통하여 언제든지 본인의 개인정보를 열람하고 수정할 수 있습니다.`,
        },
      ],
    },
    {
      title: '제3장 서비스 이용 및 권리/의무',
      description: [
        {
          title: '제7조 (서비스의 제공 등)',
          body: `1. 회사는 회원에게 정비사업 관련 정보 콘텐츠 제공 및 기타 회사가 추가 개발하는 서비스를 제공합니다.
2. 회사는 서비스의 내용, 운영상, 기술상 필요에 따라 제공하는 서비스를 변경할 수 있으며, 이 경우 변경 내용을 공지합니다.`,
        },
        {
          title: '제8조 (회원의 의무)',
          body: `1. 회원은 신청 시 허위 내용을 등록하거나 타인의 정보를 도용하는 행위 등 관계 법령 및 본 약관을 위반하는 행위를 하여서는 안 됩니다.`,
        },
        {
          title: '제9조 (접속 기록 수집 및 이용)',
          body: `1. 회원은 신청 시 허위 내용을 등록하거나 타인의 정보를 도용하는 행위 등 관계 법령 및 본 약관을 위반하는 행위를 하여서는 안 됩니다.`,
        },
      ],
    },
  ],
};
